In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [3]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [4]:
salary_year = df['salary_year_avg'].median()

In [5]:
salary_hour = df['salary_hour_avg'].median()

In [8]:
df_filied = df

df_filied['salary_year_avg'] = df_filied['salary_year_avg'].fillna(salary_year)
df_filied['salary_hour_avg'] = df_filied['salary_hour_avg'].fillna(salary_hour)

In [9]:
df_filied.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [2]:
df_unique = df_filied

df_unique = df_unique.drop_duplicates()

NameError: name 'df_filied' is not defined